// Вам потрібно створити програму, яка мутує значення кожного елемента в масиві за допомогою методу map.
// Ось кроки, які вам потрібно виконати:
// Створіть початковий масив, наприклад, [1, 2, 3, 4, 5].
// Створіть новий масив, де кожне значення це елемент вихідного масиву помножений на значення індексу відповідного елемента початкового масиву.
// Виведіть новий масив на консоль.

const arr = [7, 2, 3, 4, 5, 8, 12, 4, 2, 3, 4, 5, 6, 7, 8, 9, 10 ];
for (const arrayNumbers of arr) {
}
console.log("Массив : " + arr);
const arrayIndex = [];
for (let i = 0; i < arr.length; i++) {
    arrayIndex.push(arr[i] * arrayIndex.length);
}
console.log( "Элементы массива умноженные на индекс: " + arrayIndex);0